_protected/models/ActivityProfileQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `proman_activity_profile` WHERE `profile_id`=35