_protected/models/ProjectProfileQuery.php

SELECT * FROM `proman_project_profile` WHERE `profile_id`=35
---
    public function all($db = null)
    {
        return parent::all($db);