_protected/models/TaskProfileQuery.php

SELECT * FROM `proman_task_profile` WHERE `profile_id`=35
---
    public function all($db = null)
    {
        return parent::all($db);