_protected/models/UserDetailQuery.php

    public function one($db = null)
    {
        return parent::one($db);
---
SELECT * FROM `proman_user_detail` WHERE `user_id`=2